Documents/РазмещениеПоЯчейкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РазмещениеПоЯчейкам</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтПокупателя</xr:Item>
				<xr:Item>Document.ОприходованиеТоваров</xr:Item>
				<xr:Item>Document.КорректировкаРеализации</xr:Item>
				<xr:Item>Document.ПересортицаТоваров</xr:Item>
				<xr:Item>Document.ЗаданиеНаИнвентаризацию</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровНаОтветственноеХранение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПалетноеХранение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОРасхожденияхПослеПриемки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаОтветственноеХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаИнвентаризацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроверять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клеверенс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УжеРазмещены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВведеноВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РазмещениеПоЯчейкам/Ext/ManagerModule.bsl
Процедура ПровестиДокументыБезДвижений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВЯчейкахОбороты.Регистратор
	|ПОМЕСТИТЬ ВТ_Регистраторы
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыВЯчейкахОбороты
	|ГДЕ
	|	ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.РазмещениеПоЯчейкам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкам.Ссылка
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам КАК РазмещениеПоЯчейкам
	|ГДЕ
	|    
	|	РазмещениеПоЯчейкам.Клеверенс = ИСТИНА
	|	И НЕ РазмещениеПоЯчейкам.Ссылка В                                                           
	|				(ВЫБРАТЬ                                                   
	|					ВТ_Регистраторы.Регистратор
	|				ИЗ
	|					ВТ_Регистраторы КАК ВТ_Регистраторы)
	|	И РазмещениеПоЯчейкам.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";                       
	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()) );
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата() - 24 * 3600 * 30));
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		РазмПоЯчейкамОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		РазмПоЯчейкамОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла; 
	 
КонецПроцедуры

Функция ЕстьПодчиненныеДокументыРазмещениеПоЯчейкам(ДокОснование) Экспорт
	
	//+Сёмин Р. 11.02.2026 #UT10-5677
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмещениеПоЯчейкам.Ссылка
		|ИЗ
		|	Документ.РазмещениеПоЯчейкам КАК РазмещениеПоЯчейкам
		|ГДЕ
		|	РазмещениеПоЯчейкам.ДокументОснование = &ДокументОснование
		|	И НЕ РазмещениеПоЯчейкам.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	//-Сёмин Р. 11.02.2026 #UT10-5677
	
КонецФункции
